[
  {
    "dateCreated": "2024-03-01",
    "category": "gen_news",
    "title": "DPWH Engineer Murdered Amid Initial Corruption Whisperings",
    "description": "The municipal engineer of a town in Central Luzon was murdered, becoming one of a dozen such killings since 2023 targeting engineers from the DPWH and local governments. While authorities did not immediately link the killing to corruption, sources suggested it was related to local resistance against anomalous, over-budgeted flood control projects that were substandard or never built ('ghost projects'). This preceded the full eruption of the national scandal.",
    "url": "https://www.rappler.com/news/nation/dpwh-engineer-killed-amid-flood-control-corruption-probe/",
    "source": "Rappler"
  },
  {
    "dateCreated": "2024-06-25",
    "category": "gen_news",
    "title": "Initial Media Reports on P100 Billion in 'Ghost Projects'",
    "description": "The Philippine Center for Investigative Journalism (PCIJ) released a groundbreaking report highlighting significant irregularities in the DPWH's flood control budget for 2024. The report alleged that over ₱100 billion had been cornered by a small group of favored contractors linked to high-ranking officials, leading to the proliferation of 'ghost projects' and highly substandard infrastructure that failed during minor typhoons. This report effectively lit the fuse for the full-blown scandal.",
    "url": "https://pcij.org/report/p100-billion-in-flood-control-ghost-projects-exposing-the-dpwh-cartel/",
    "source": "PCIJ"
  },
  {
    "dateCreated": "2024-07-22",
    "category": "gen_news",
    "title": "President Marcos' Third SONA Avoids Corruption Issue",
    "description": "In his third State of the Nation Address (SONA), President Ferdinand Marcos Jr. outlined infrastructure plans and economic progress, but conspicuously failed to address the burgeoning reports of massive corruption within the DPWH's flood control program, disappointing civil society groups. The 2025 National Expenditure Program (NEP) prepared after this speech still included a substantial allocation for flood control, further drawing scrutiny.",
    "url": "https://newsinfo.inquirer.net/2080101/marcos-third-sona-highlights-infrastructure-but-silent-on-dpwh-scandal",
    "source": "Inquirer.net"
  },
  {
    "dateCreated": "2024-11-05",
    "category": "gen_news",
    "title": "Senate Committee Launches Inquiry 'Philippines Under Water'",
    "description": "The Senate Blue Ribbon Committee, led by Senator Rodante Marcoleta, formally initiated a motu proprio investigation into the multi-billion-peso flood control scandal, dubbing it 'Philippines Under Water.' The investigation focused on allegations of kickbacks, license-renting schemes, and misallocation of the ₱545.6 billion flood mitigation budget released by the Marcos administration from 2022 to mid-2025.",
    "url": "https://senate.gov.ph/press_release/senate-blue-ribbon-committee-starts-probe-into-flood-control-scandal",
    "source": "Senate of the Philippines"
  },
  {
    "dateCreated": "2024-12-02",
    "category": "zaldy",
    "title": "Alleged ₱200 Million Kickback Delivered for Marcos",
    "description": "Zaldy Co claimed in his video statement that, upon the direct order of then-House Speaker Martin Romualdez, he delivered ₱200 million in cash to Justice Undersecretary Jose Cadiz Jr. at a Forbes Park residence. Co alleged Cadiz was a 'bagman' for President Marcos Jr. and that this delivery was to appease the President, who was reportedly angry over not receiving his 'cut' from DPWH projects. The President swiftly denied the allegation.",
    "url": "https://www.philstar.com/headlines/2025/11/24/2489580/zaldy-co-says-he-personally-delivered-p1-billion-kickbacks-marcos",
    "source": "The Philippine Star"
  },
  {
    "dateCreated": "2024-12-05",
    "category": "zaldy",
    "title": "Alleged Second ₱800 Million Delivery to Marcos Intermediary",
    "description": "Zaldy Co claimed a second delivery occurred just days later, wherein he delivered another ₱800 million in cash to the same Forbes Park collection point and intermediary, Undersecretary Cadiz. This brought the total alleged direct cash delivery for the President's share in December 2024 to ₱1 billion. Co claimed all the cash was concealed in suitcases and brought by himself, his driver, and his staff.",
    "url": "https://www.abs-cbn.com/news/nation/2025/11/24/co-claims-he-was-ordered-to-deliver-p2-billion-monthly-for-romualdez-marcos-1718",
    "source": "ABS-CBN News"
  },
  {
    "dateCreated": "2024-12-30",
    "category": "gen_news",
    "title": "Marcos Signs 2025 National Budget, Vetoes ₱194 Billion in Line Items",
    "description": "President Marcos Jr. signed the ₱6.352 trillion 2025 National Budget into law, which represented a 10.1% increase over the 2024 budget. In his signing speech, he announced the veto of ₱194 billion worth of line items, citing inconsistency with national development plans. Despite the ongoing scandal, the budget retained a substantial allocation for water resources development and flood control, approximately ₱257.1 billion.",
    "url": "https://www.abs-cbn.com/news/business/2024/12/30/marcos-signs-2025-national-budget-1027",
    "source": "ABS-CBN News"
  },
  {
    "dateCreated": "2025-02-05",
    "category": "gen_news",
    "title": "Vice President Sara Duterte Impeached by House Over Confidential Funds",
    "description": "In a major political shift, the House of Representatives voted to impeach Vice President Sara Duterte over multiple charges, including allegations of malversation of ₱612.5 million in confidential funds. This event further strained the relationship between the President's camp and the Duterte family, adding to the climate of political turmoil and heightened scrutiny over public funds.",
    "url": "https://www.gmanetwork.com/news/politics/nation/932452/sara-duterte-impeached-by-house-of-representatives-over-confidential-funds/story/",
    "source": "GMA News"
  },
  {
    "dateCreated": "2025-03-11",
    "category": "gen_news",
    "title": "Former President Rodrigo Duterte Arrested and Handed to ICC",
    "description": "Former President Rodrigo Duterte was arrested and subsequently handed over to the International Criminal Court (ICC) to face investigation related to his 'War on Drugs' campaign. The arrest and handover, severely criticized by his supporters, marked an unprecedented development that further destabilized the national political landscape and was seen as a move by the current administration to consolidate power.",
    "url": "https://www.reuters.com/world/asia-pacific/philippines-arrests-former-president-duterte-hands-him-over-to-icc-2025-03-11/",
    "source": "Reuters"
  },
  {
    "dateCreated": "2025-05-22",
    "month": "May",
    "title": "Cabinet Reshuffle Follows Midterm Election Results",
    "description": "Following the results of the 2025 midterm elections, President Marcos Jr. called for the courtesy resignations of cabinet members and agency heads, initiating the first major cabinet reshuffle since the Arroyo administration. This move was widely interpreted as an attempt to regain public trust and restructure the executive branch amidst the growing corruption scandal.",
    "url": "https://www.philstar.com/headlines/2025/05/22/2489115/marcos-begins-major-cabinet-reshuffle-after-midterms",
    "source": "The Philippine Star"
  },
  {
    "dateCreated": "2025-07-28",
    "category": "gen_news",
    "title": "President Marcos' Fourth SONA Orders Mass Corruption Probe",
    "description": "In his fourth State of the Nation Address (SONA), President Marcos Jr. publicly denounced the 'ghost projects' and structurally deficient flood control projects despite massive budgets. He directed the DPWH to submit a full list of projects for public verification, vowed to file charges against all guilty officials, and announced ten large-scale projects amounting to more than ₱500 billion to correct past failures.",
    "url": "https://www.brigadanews.ph/president-bongbong-marcos-rages-at-flood-control-failures-demands-probe-into-ghost-projects-and-threatens-jail-time-for-corrupt-officials/",
    "source": "Brigada News"
  },
  {
    "dateCreated": "2025-09-03",
    "category": "gen_news",
    "title": "DOJ Issues Lookout Bulletin Orders for 43 Individuals",
    "description": "Justice Secretary Jesus Crispin Remulla signed two Immigration Lookout Bulletin Orders (ILBOs) against 43 individuals implicated in the anomalous flood control projects. The list was based on names submitted by Senate Blue Ribbon Committee chairperson Rodante Marcoleta and DPWH Secretary Vince Dizon, signaling the first concrete legal action against those involved.",
    "url": "https://en.wikipedia.org/wiki/Flood_control_projects_scandal_in_the_Philippines",
    "source": "Wikipedia"
  },
  {
    "dateCreated": "2025-09-17",
    "category": "gen_news",
    "title": "House Speaker Martin Romualdez Resigns Amidst Scandal Pressure",
    "description": "Leyte Representative Martin Romualdez formally stepped down as Speaker of the House of Representatives, a move widely viewed as a result of mounting pressure and public indignation stemming from his alleged involvement in the flood control corruption scandal. He was succeeded by Isabela 6th District Rep. Faustino 'Bojie' Dy. Romualdez's resignation paved the way for a major leadership change in the legislative branch.",
    "url": "https://asianews.network/philippine-house-speaker-romualdez-formally-steps-down/",
    "source": "Asian News Network"
  },
  {
    "dateCreated": "2025-09-21",
    "category": "gen_news",
    "title": "Trillion Peso March: Massive Anti-Corruption Protests",
    "description": "Massive anti-corruption demonstrations, labeled the 'Trillion Peso March,' were held across Metro Manila, particularly at Luneta Park. Protesters, organized by civil society and church groups, demanded accountability for the estimated ₱1.9 trillion allegedly lost to corruption in flood control and other projects over the past 15 years, coinciding with the anniversary of the 1972 Martial Law declaration.",
    "url": "https://en.wikipedia.org/wiki/Trillion_Peso_March",
    "source": "Wikipedia"
  },
  {
    "dateCreated": "2025-11-14",
    "category": "zaldy",
    "title": "Zaldy Co Claims Marcos Ordered ₱100-B Budget Insertion and Told Him to Flee",
    "description": "Former Ako Bicol party-list representative Zaldy Co released a video statement from abroad, alleging that President Marcos Jr. and then-Speaker Romualdez ordered him to insert ₱100 billion worth of flood control projects into the 2025 national budget during the bicameral conference. He also claimed Romualdez told him to leave the country 'as instructed by the President' when the scandal broke, implicating the highest office in the budget insertions.",
    "url": "https://www.youtube.com/watch?v=iGJ4MJbmvFk",
    "source": "YouTube"
  },
  {
    "dateCreated": "2025-11-24",
    "category": "zaldy",
    "title": "Co Details ₱56 Billion Kickback Scheme, ₱2 Billion Monthly Deliveries",
    "description": "In his second major video, Zaldy Co provided intricate details of an alleged kickback scheme, claiming he was ordered by Romualdez to deliver ₱2 billion in kickbacks monthly from DPWH projects from 2022 to 2025, totaling ₱56.4 billion. Co stated Romualdez claimed he split this money equally with President Marcos Jr. This statement also included the specific allegations of the ₱1 billion deliveries made in December 2024.",
    "url": "https://www.abs-cbn.com/news/nation/2025/11/24/co-claims-he-was-ordered-to-deliver-p2-billion-monthly-for-romualdez-marcos-1718",
    "source": "ABS-CBN News"
  },
  {
    "dateCreated": "2025-11-25",
    "category": "gen_news",
    "title": "Sandiganbayan Issues Arrest Warrants for Zaldy Co; Interpol Notice Confirmed",
    "description": "The Sandiganbayan issued an arrest warrant against Zaldy Co and others for graft and malversation related to an anomalous ₱289.5-million road dike project funded by the 2024 DPWH budget. DILG Secretary Jonvic Remulla confirmed an Interpol Blue Notice was issued. President Marcos Jr. publicly challenged Co to return home to prove his claims under oath, dismissing the allegations as fabrications from an indicted fugitive.",
    "url": "https://www.manilatimes.net/2025/11/25/news/national/marcos-dares-zaldy-co-stop-hiding-and-come-home/2230206",
    "source": "The Manila Times"
  },
  {
    "dateCreated": "2025-11-26",
    "category": "zaldy",
    "title": "President Marcos Accuses Zaldy Co of Blackmail",
    "description": "President Ferdinand Marcos Jr. released his own statement alleging that Zaldy Co's camp attempted to blackmail him to prevent the cancellation of Co's passport. The President asserted he would 'not negotiate with criminals' and doubled down on his challenge for Co to return to the Philippines to face the charges against him and make his allegations under oath, characterizing Co's videos as a political destabilization effort.",
    "url": "https://www.youtube.com/watch?v=ardLqoZxTP8",
    "source": "YouTube"
  },
  {
    "dateCreated": "2025-11-27",
    "category": "zaldy",
    "title": "Co Implicates First Lady in Cartel Investigation Halting; Total Insertions Claimed to be ₱253 Billion",
    "description": "In his third video, Zaldy Co further expanded his claims, alleging that First Lady Liza Araneta-Marcos intervened to halt House investigations into the onion and rice cartels after her brother's name (Martin Araneta) was implicated. Co also alleged that the total budget insertions for which President Marcos and Romualdez benefited amounted to ₱253 billion across the 2023, 2024, and 2025 national budgets, vastly increasing the alleged corruption amount.",
    "url": "https://newsinfo.inquirer.net/2147347/fwd-first-lady-liza-marcos-dismisses-zaldy-cos-accusations-as-political-theatrics",
    "source": "Inquirer.net"
  },
  {
    "dateCreated": "2025-11-27",
    "category": "gen_news",
    "title": "AMLC Freezes ₱12 Billion in Zaldy Co's Assets",
    "description": "President Marcos Jr. announced that the Anti-Money Laundering Council (AMLC) had frozen ₱12 billion worth of assets belonging to Zaldy Co, including real estate properties and an aircraft, as part of the government's aggressive campaign to recover funds lost to the flood control corruption scandal. This action underscored the seriousness of the legal case being built against the former lawmaker.",
    "url": "https://www.philstar.com/headlines/2025/11/26/2489931/co-wants-overthrow-administration-rep-marcos",
    "source": "The Philippine Star"
  }
]