[
  {
    "dateCreated": "2024-03-01",
    "month": "March",
    "category": "CO_ACCUSATIONS",
    "title": "Alleged Meeting with DA Chief on Sugar Imports",
    "description": "Zaldy Co allegedly invited Agriculture Secretary Francisco P. Tiu Laurel Jr. to a meeting in Polo Townhomes, Makati City, to introduce a major sugar importer seeking a 200,000 MT sugar import allocation."
  },
  {
    "dateCreated": "2024-11-01",
    "month": "November",
    "category": "CO_ACCUSATIONS",
    "title": "Marcos' Alleged Anger Over Kickbacks",
    "description": "Zaldy Co claimed that Justice Undersecretary Jose Cadiz Jr. told him and former House Speaker Martin Romualdez that President Marcos Jr. was angry because he was not receiving cuts from Department of Public Works and Highways (DPWH) projects."
  },
  {
    "dateCreated": "2024-12-02",
    "month": "December",
    "category": "CO_ACCUSATIONS",
    "title": "First Alleged P1 Billion Cash Delivery",
    "description": "Zaldy Co alleged he personally delivered P200 million in cash to Justice Undersecretary Jose Cadiz Jr. at a Forbes Park property, which he claimed Romualdez said was ordered purchased by Marcos to serve as a collection point for kickbacks."
  },
  {
    "dateCreated": "2024-12-05",
    "month": "December",
    "category": "CO_ACCUSATIONS",
    "title": "Second Alleged P1 Billion Cash Delivery",
    "description": "Zaldy Co alleged he personally delivered an additional P800 million in cash to Cadiz Jr. at the same Forbes Park property, completing the P1 billion delivery for President Marcos Jr."
  },
  {
    "dateCreated": "2025-07-28",
    "month": "July",
    "category": "GEN_NEWS",
    "title": "President Marcos Orders Investigation",
    "description": "In his State of the Nation Address (SONA), President Ferdinand Marcos Jr. publicly ordered an investigation into possible corruption in flood control projects, telling those involved, 'Mahiya naman kayo!' ('Shame on you!')."
  },
  {
    "dateCreated": "2025-09-01",
    "month": "September",
    "category": "GEN_NEWS",
    "title": "Contractor Sarah Disaya Confirms Luxury Cars, Multiple Firms at Senate Hearing",
    "description": "Sarah Disaya, one of the notorious public works contractors, appeared before the Senate Blue Ribbon Committee and confirmed her 28 luxury cars and ownership of nine construction firms that sometimes bid against each other for government projects."
  },
  {
    "dateCreated": "2025-09-04",
    "month": "September",
    "category": "GEN_NEWS",
    "title": "Start of Widespread Anti-Corruption Protests",
    "description": "A series of widespread anti-corruption demonstrations began across the Philippines, with protesters converging at the headquarters of a contracting firm and the DPWH main office."
  },
  {
    "dateCreated": "2025-09-11",
    "month": "September",
    "category": "GEN_NEWS",
    "title": "Independent Commission for Infrastructure (ICI) Established",
    "description": "President Marcos Jr. created the ICI by executive order to investigate the loss of billions of pesos in flood control funds."
  },
  {
    "dateCreated": "2025-09-21",
    "month": "September",
    "category": "GEN_NEWS",
    "title": "Massive 'Trillion Peso March' Protest",
    "description": "The largest anti-corruption protests, known as the 'Baha sa Luneta' and 'Trillion Peso March,' occurred at Rizal Park and the EDSA Shrine, demanding accountability for the corruption."
  },
  {
    "dateCreated": "2025-09-29",
    "month": "September",
    "category": "GEN_NEWS",
    "title": "Zaldy Co Resigns from Congress",
    "description": "Ako Bicol Rep. Zaldy Co resigned as a member of the House of Representatives, citing a 'direct, grave and imminent threat' to him and his family, after the ICI recommended the filing of charges against him."
  },
  {
    "dateCreated": "2025-11-14",
    "month": "November",
    "category": "CO_ACCUSATIONS",
    "title": "Zaldy Co Breaks Silence, Accuses Marcos and Romualdez of P100B Insertion",
    "description": "In an explosive recorded video, Zaldy Co broke his silence, accusing President Marcos Jr. of ordering a ₱100-billion budget insertion for infrastructure projects and implicating former House Speaker Martin Romualdez."
  },
  {
    "dateCreated": "2025-11-17",
    "month": "November",
    "category": "GEN_NEWS",
    "title": "House Leaders Dispute Co's Claims and Timeline",
    "description": "House leaders, including Deputy Majority Leaders, held a press conference to dispute Zaldy Co's claims and evidence, pointing out that his photos of cash deliveries were dated early 2024, which conflicts with his claim that the P100-billion budget insertion was ordered later that year."
  },
  {
    "dateCreated": "2025-11-21",
    "month": "November",
    "category": "GEN_NEWS",
    "title": "Arrest Warrants Confirmed Against Zaldy Co and Others",
    "description": "President Marcos Jr. confirmed that the Sandiganbayan had issued arrest warrants for Zaldy Co and 17 others connected to an allegedly irregular P289.5-million flood control project in Oriental Mindoro. Tracker teams were immediately deployed."
  },
  {
    "dateCreated": "2025-11-24",
    "month": "November",
    "category": "CO_ACCUSATIONS",
    "title": "Co Alleges Personally Delivering P1 Billion Kickbacks to Marcos Intermediary",
    "description": "In a new video, Zaldy Co alleged he personally delivered P1 billion in cash to Justice Undersecretary Jose Cadiz Jr., who he claimed was an intermediary for President Marcos Jr. The President swiftly dismissed the claim and challenged Co to make it under oath."
  },
  {
    "dateCreated": "2025-11-27",
    "month": "November",
    "category": "GEN_NEWS",
    "title": "DA Chief Slams Co's Claims as 'Fabricated Lies'",
    "description": "Agriculture Secretary Francisco P. Tiu Laurel Jr. rebuked Zaldy Co's latest corruption allegations, calling them 'fabricated lies' crafted to divert attention from his own legal troubles. Tiu Laurel detailed encounters with Co where the former lawmaker allegedly sought import allocations, which were denied."
  }
]